nodejs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Nodejs read note</title>
<!-- 2016-08-20 Sat 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="guozhen" />
</head>
<body>
<div id="content">
<h1 class="title">Nodejs read note</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. nodejs The Definitive Guide</a>
<ul>
<li><a href="#sec-1-1">1.1. Basic Knowledge</a></li>
<li><a href="#sec-1-2">1.2. Buffer</a></li>
<li><a href="#sec-1-3">1.3. link</a></li>
<li><a href="#sec-1-4">1.4. stream</a></li>
<li><a href="#sec-1-5">1.5. tcp</a></li>
<li><a href="#sec-1-6">1.6. http</a></li>
<li><a href="#sec-1-7">1.7. process</a></li>
<li><a href="#sec-1-8">1.8. child<sub>process</sub></a></li>
<li><a href="#sec-1-9">1.9. figure out</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Node.js in Action</a>
<ul>
<li><a href="#sec-2-1">2.1. figure out</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. <span class="todo TODO">TODO</span> bcrypt random slat</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> nodejs The Definitive Guide</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Basic Knowledge</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>console.time('small loop') console.timeEnd('small loop') 计算一段代码执行时间.
</li>
</ol>
<p>
vvv2. conosle.trace(label) 将当前栈信息作为标准错误信息输出
</p>
<ol class="org-ol">
<li>console.assert()
</li>
<li>global 是nodejs 运行环境中的全局对象
</li>
<li>setInterval or setTimeout  (cb, ms, [arg], [&#x2026;]) 第三个参数开始为需向回调传递的参数
</li>
<li>对于timer对象有 unref 暂时取消调用  ref则恢复调用
</li>
<li>require.resolve('./module') 用来获取某个模块文件的绝对路径 (不回加载模块)
</li>
<li>require.cache[require.resolve('./module') 获取缓存模块
</li>
<li>_<sub>filename</sub> _<sub>dirname</sub> 当前文件的完整路径 or 所在文件夹
</li>
<li>nodejs模块中事件处理 继承
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Buffer</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>new Buffer(size) (字节)
</li>
<li>String 类型不可变 Buffer类型可变 slice 对string 操作是复制 对 Buffer 是共享
</li>
<li>将buffer 内容转换为字符串使用toString() or StringDeocoder对象
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> link</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>hard link: a hard link is a directory entry that associates a name with a file on a file system , Creating a hard link has the effect of giving one file multiple namesjust.
</li>
<li>symbolic link: a symbolic link (also symlink or soft link) is the nickname for any file that contains a reference to another file or directory in the form of an absolute or relative path and that affects pathname resolution.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> stream</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>following mode
</li>
<li>following mode 
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> tcp</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>options: allowHalfOpen when TCP server accpet FIN package don't sned FIN back. 服务器可以继续向客服端发送数据,但不会接受客户端的数据,需要end()来结束socket.
</li>
<li>当在一个慢速网络环境中需要发送大量时，TCP会将这些数据放在nodejs的缓冲队列,而非操作系统的tcp缓冲区。
</li>
<li>socket 是对tcp/ip协议的封装抽象的编程接口,方便程序员使用tcp/ip协议栈
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> http</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>when invoke http.ServerResponse's write or wiriteHead method ,send the header right away.
</li>
<li></li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> process</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>nextTick is invoked before setTimeout(fn, 0).
</li>
<li>nextTick 可以用于讲函数推迟到下一个异步代码回调调用前调用
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> child<sub>process</sub></h3>
<div class="outline-text-3" id="text-1-8">
<ol class="org-ol">
<li><a href="http://stackoverflow.com/questions/17861362/node-js-child-process-difference-between-spawn-fork">difference between Spawn &amp; fork</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> figure out</h3>
<div class="outline-text-3" id="text-1-9">
<ol class="org-ol">
<li>nodejs Eventloop
</li>
<li>when exports as class need use module.exports 
</li>
<li>buufer read/write numberx
</li>
<li>file descriptor
</li>
<li>telnet protocol
</li>
<li>http 1.1 support chunked
</li>
<li>public key and private key
</li>
<li></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Node.js in Action</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> figure out</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> <span class="todo TODO">TODO</span> bcrypt random slat</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: guozhen</p>
<p class="date">Created: 2016-08-20 Sat 22:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
